Repository: MartinZikmund/PlayingWithPhysics
Catalog: src/Topics/Physics.HuygensPrinciple/Strings/*/Resources.resw
Source language: en_us
Languages: cs_cz

# AppDescription
source: The Huygens' principle is a simple prescription for wave propagation in an isotropic medium. It states that every point of a wavefront becomes a source of a secondary spherical wavelet and that the real wavefront at a later time can be found as an outer envelope of all these wavelets. The app simulates the time evolution of arbitrarily shaped wavefronts. The basic and advanced variants employ different algorithms, both of which are, however, based on the Huygens’ principle. The former enables one to predict the propagation of a wave in a homogeneous medium while the latter models also the situations in which barriers are drawn by the user. The usage of this approach for tsunami prediction after an earthquake is also demonstrated. The application enables the user to study the physics of wave propagation, but also to analyse the capabilities and limitations of various computer simulations. Content authors: Matěj Hudec Programmers: Daniel Zikmund, Martin Zikmund Graphics: Petr Weinlich
cs_cz: Huygensův princip popisuje šíření vln v izotropním prostředí. Říká, že každý bod vlnoplochy v uvažovaném čase lze chápat jako zdroj sekundární sférické vlny a že tvar vlnoplochy v pozdějším čase je dán vnější obálkou všech sekundárních vlnoploch. Aplikace obsahuje počítačové simulace časového vývoje vlnoploch libovolného počátečního tvaru. Základní a pokročilá varianta využívají rozdílné algoritmy, oba však vycházejí z Huygensova principu. První varianta predikuje šíření vlny v homogenním prostředí, zatímco v druhé lze modelovat též situace, v nichž uživatel nakreslí neprostupnou překážku. Aplikace též umožňuje demonstrovat využití tohoto přístupu při předpovídání tsunami po zemětřesení. Aplikace může sloužit nejen ke studiu fyziky šíření vln, ale též k uvědomění si možností a limitů různých počítačových simulací. Autoři obsahu: Matěj Hudec Programátoři: Martin Zikmund, Daniel Zikmund Grafika: Petr Weinlich

# AppName
source: Playing with Physics: Huygens' Principle
cs_cz: Hrátky s fyzikou: Huygensův princip

source: Brush
cs_cz: Štětec

source: Brush shape
cs_cz: Tvar štětce

source: Brush size
cs_cz: Velikost štětce

# CellState_Empty
source: Empty
cs_cz: Prázdno

# CellState_Source
source: Source
cs_cz: Zdroj

# CellState_Wall
source: Wall
cs_cz: Zeď

# ClearDrawing
source: Undo all changes
cs_cz: Zahodit změny

# Demo_Chicxulub_Description
source: The Chicxulub crater, about 200 kilometers in diameter, was formed 66 million years ago by a meteorite impact into a shallow sea. Climate change caused by impact and increased volcanic activity is considered to be the cause of the extinction of dinosaurs. The impact caused a giant tsunami, whose traces of limestone breccia are found in Cuba, for example. Its thickness here reaches up to 180 meters. The map shows what the impact area looked like 66 million years ago.
cs_cz: Chicxulubský kráter o průměru zhruba 200 kilometrů vznikl před 66 miliony lety dopadem meteoritu do mělkého moře. Změny podnebí vyvolané dopadem a zvýšenou vulkanickou činností jsou považovány za příčinu vyhynutí dinosaurů. Dopad vyvolal obří vlnu tsunami, jejíž stopy v podobě vápencové brekcie se nachází například na Kubě. Její mocnost zde dosahuje až 180 metrů. Mapa zobrazuje, jak vypadala oblast dopadu před 66 miliony roky.

# Demo_Chicxulub_Name
source: Chicxulub crater
cs_cz: Chicxulubský kráter

# Demo_Japan_Description
source: An earthquake measuring 8.9 on the Richter scale struck Japan on March 11, 2011. The epicenter was located in the sea about 130 kilometers from the island of Honshu. The rise of the seabed by 5-8 meters caused waves that reached a height of 15 meters on the coast of Japan. The Fukushima I nuclear power plant was also affected by the disaster. The power plant accident is considered to be the worst since the 1986 Chernobyl accident.
cs_cz: Zemětřesení o síle 8,9 Richterovy škály zasáhlo 11. března 2011 Japonsko. Epicentrum se nacházelo v moři zhruba 130 kilometrů od ostrova Honšú. Zdvih mořského dna o 5–8 metrů vyvolal vlny, které na pobřeží Japonska dosahovaly výšky až 15 m. Katastrofou byla také zasažena jaderná elektrárna Fukušima I. Havárie elektrárny je považována za nejhorší od černobylské havárie z roku 1986.

# Demo_Japan_Name
source: Japan
cs_cz: Japonsko

# Demo_Krakatoa_Description
source: Krakatoa (formerly Rakata) is an active volcano in the Sunda Strait, between the Indonesian islands of Java and Sumatra. It was formed in 1883 from the original volcano during the self-destructive eruption of the submarine caldera. The eruption of the volcano was accompanied by a 40-meter tsunami that killed 36,000 people. 400 people died in the 2018 tsunami.
cs_cz: Krakatoa (dříve též Rakata) je aktivní sopkou v Sundském průlivu, mezi indonéskými ostrovy Jáva a Sumatra. Roku 1883 vznikla z původní sopky při sebezničujícím výbuchu podmořská kaldera. Výbuch sopky byl doprovázen čtyřicetimetrovou tsunami, které podlehlo 36 000 lidí. V tsunami z roku 2018 zemřelo 400 lidí.

# Demo_Krakatoa_Name
source: Krakatoa
cs_cz: Sopka Krakatoa

# Demo_Santorini_Description
source: The Santorini archipelago is a remnant of the volcanic island of Thera. The volcanic eruption occurred at the turn of the 17th and 16th centuries BC. The center of the island collapsed during the eruption. This event is associated with the destruction of the mythical Atlantis or the ten Egyptian wounds. The tsunami ravaged the surrounding islands and the coast of Crete and is considered by some to be the cause of the demise of Minoan civilization.
cs_cz: Souostroví Santorini je zbytkem sopečného ostrova Théra. K sopečné erupci došlo na přelomu 17. a 16. století před naším letopočtem. Při erupci se propadl střed ostrova. Tato událost je spojována se zničením bájné Atlantidy či deseti egyptskými ranami. Tsunami pustošila okolní ostrovy a pobřeží Kréty a je některými považována za příčinu zániku minojské civilizace.

# Demo_Santorini_Name
source: Santorini (Thera)
cs_cz: Santorini (Théra)

# Demo_Vesuvius_Description
source: The Italian volcano Mount Vesuvius became famous for its eruption in 79, during which the cities of Pompeii and Herculaneum were destroyed. As the volcano is located near the sea, it is possible that some of the next eruptions will cause a tsunami that will threaten the densely populated coast of the Gulf of Naples.
cs_cz: Italská sopka Vesuv proslula svým výbuchem v roce 79, při kterém byly zničeny města Pompeje a Herculaneum. Jelikož se sopka nachází v blízkosti moře, je možné, že některá z příštích erupcí vyvolá tsunami, která ohrozí hustě obydlené pobřeží neapolského zálivu.

# Demo_Vesuvius_Name
source: Vesuvius
cs_cz: Sopka Vesuv

source: Drawing
cs_cz: Kreslení

# DrawingTool
source: Tool
cs_cz: Nástroj

# DrawingTool_Brush
source: Brush
cs_cz: Štětec

# DrawingTool_Eraser
source: Eraser
cs_cz: Zmizík

# DrawingWarning
source: Warning! The result of the simulation may be non-realistic when the wall thickness is smaller than the radius of the secondary wave used!
cs_cz: Pozor, při kreslení stěn tenčích než uvažovaný poloměr sekundární vlny může být výsledek simulace nerealistický!

source: Ellipse
cs_cz: Elipsa

source: Eraser
cs_cz: Zmizík

source: Field size
cs_cz: Velikost pole

source: Off
cs_cz: Vypnuto

source: On
cs_cz: Zapnuto

# PickScenePreset
source: Pick a scenario...
cs_cz: Vybrat scénář...

source: Rectangle
cs_cz: Obdélník

source: Save and start
cs_cz: Uložit a spustit

# ScenePreset_Brick
source: Rectangle
cs_cz: Obdélník

# ScenePreset_Circle
source: Circle
cs_cz: Kruh

# ScenePreset_Line
source: Line
cs_cz: Přímka

# ScenePreset_LineWall
source: Line with wall
cs_cz: Přímka se zdí

# ScenePreset_PointWall
source: Point with wall
cs_cz: Bod se zdí

# ScenePreset_Snowman
source: Snowman
cs_cz: Sněhulák

# ScenePreset_Square
source: Square
cs_cz: Čtverec

# SelectDemo
source: Select a demo:
cs_cz: Vyberte si demo:

source: Set
cs_cz: Nastavit

source: Set default
cs_cz: Nastavit výchozí

source: Settings
cs_cz: Nastvení

# ShapeType_Circle
source: Circle
cs_cz: Kruh

# ShapeType_Square
source: Square
cs_cz: Čtverec

# ShortAppName
source: Huygens' Principle
cs_cz: Huygensův princip

source: Show sample points
cs_cz: Zobrazit ukázkové body

source: Show source
cs_cz: Zobrazit zdroj

# ShowWave
source: Show affected area
cs_cz: Zobrazit zasaženou oblast

# ShowWaveEdge
source: Show wavefront
cs_cz: Zobrazit okraj vlny

source: Start drawing
cs_cz: Spustit kreslení

source: Step radius
cs_cz: Poloměr kroku

# SurfaceType
source: Type
cs_cz: Typ
